leetcode_44_wildcard_matching.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 44. Wildcard Matching</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 44. Wildcard Matching</h1>
<ul class="org-ul">
<li><a href="mistake_missing_edge_case.html#ID-29B5FD8A-98FD-48CE-8C30-04671E44AD27">Mistake: Missing edge case</a>.  I solved a problem like this before and again I forgot to test
<code>s="", p="*"</code> and <code>s="a..", p="*a..."</code>.</li>

<li><a href="how_can_we_extend_the_solution_for_i_to_i_1.html#ID-45B9F3C8-D007-4980-95EF-4361906245A8">How can we extend the solution for \(i\) to \(i+1\)?</a>  We should compute \(dp[i][j]\) which means that \(s[i..(n-1)]\) matches \(p[j..(m-1)]\).  If the <a href="dynamic_programming.html#ID-241ABA4C-A86F-405F-B6FC-85BF441EB24B">Dynamic Programming</a> isn't clear at first, write the recursive function and them translate it to an iterative algorithm.  Time and space complexity is \(O(n \times m)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">isMatch</span>(<span style="font-weight: bold;">self</span>, s: <span style="font-weight: bold;">str</span>, p: <span style="font-weight: bold;">str</span>) -&gt; <span style="font-weight: bold;">bool</span>:
        s += <span style="font-style: italic;">"$"</span>
        <span style="font-weight: bold; font-style: italic;">p</span> += <span style="font-style: italic;">"$"</span>
        <span style="font-weight: bold; font-style: italic;">N</span> = <span style="font-weight: bold;">len</span>(s)
        <span style="font-weight: bold; font-style: italic;">M</span> = <span style="font-weight: bold;">len</span>(p)

        <span style="font-weight: bold; font-style: italic;">dp</span> = [[<span style="font-weight: bold; text-decoration: underline;">False</span>] * (M + 1) <span style="font-weight: bold;">for</span> _ <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N + 1)]
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N, -1, -1):
            <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(M, -1, -1):
                <span style="font-weight: bold;">if</span> i == N <span style="font-weight: bold;">and</span> j == M:
                    dp[i][<span style="font-weight: bold; font-style: italic;">j</span>] = <span style="font-weight: bold; text-decoration: underline;">True</span>
                <span style="font-weight: bold;">elif</span> i == N <span style="font-weight: bold;">or</span> j == M:
                    dp[i][<span style="font-weight: bold; font-style: italic;">j</span>] = <span style="font-weight: bold; text-decoration: underline;">False</span>
                <span style="font-weight: bold;">elif</span> p[j] == <span style="font-style: italic;">"?"</span>:
                    dp[i][j] = dp[i + 1][j + 1]
                <span style="font-weight: bold;">elif</span> s[i] == p[j]:
                    dp[i][j] = dp[i + 1][j + 1]
                <span style="font-weight: bold;">elif</span> p[j] == <span style="font-style: italic;">"*"</span>:
                    dp[i][j] = dp[i][j + 1] <span style="font-weight: bold;">or</span> dp[i + 1][j] <span style="font-weight: bold;">or</span> dp[i + 1][j + 1]
                <span style="font-weight: bold;">else</span>:
                    dp[i][j] = <span style="font-weight: bold; text-decoration: underline;">False</span>

        <span style="font-weight: bold;">return</span> dp[0][0]


<span style="font-weight: bold;">assert</span> Solution().isMatch(<span style="font-style: italic;">"aa"</span>, <span style="font-style: italic;">"a"</span>) == <span style="font-weight: bold; text-decoration: underline;">False</span>
<span style="font-weight: bold;">assert</span> Solution().isMatch(<span style="font-style: italic;">"aa"</span>, <span style="font-style: italic;">"*"</span>) == <span style="font-weight: bold; text-decoration: underline;">True</span>
<span style="font-weight: bold;">assert</span> Solution().isMatch(<span style="font-style: italic;">"cb"</span>, <span style="font-style: italic;">"?a"</span>) == <span style="font-weight: bold; text-decoration: underline;">False</span>
</pre>
</div>
</div>
</body>
</html>